Value is out of range ! Please enter a number between [Value] and [Value].
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ValueOutOfRange { get; }
  Visual Basic
Public Shared ReadOnly Property ValueOutOfRange As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ValueOutOfRange {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GeneralFailures Class
  Autodesk.Revit.DB Namespace